Revit 2026 API

# ScheduleDefinitionCanSortByField Method

---

Checks whether a field can be used for sorting/grouping.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanSortByField(
	ScheduleFieldId fieldId
)
```
```vb
Public Function CanSortByField (
	fieldId As ScheduleFieldId
) As Boolean
```
```cpp
public:
bool CanSortByField(
	ScheduleFieldId^ fieldId
)
```
```fsharp
member CanSortByField :
        fieldId : ScheduleFieldId -> bool
```

#### Parameters

fieldId ScheduleFieldId
     The ID of the field to check.

#### Return Value

Boolean True if the field can be used for sorting/grouping, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

Schedules cannot be sorted/grouped by the Count field, Percentage fields, or Formula fields that depend on Percentage fields because those types of fields don't have meaningful values until after sorting and grouping takes place.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace